karmanyaahm/circuitpython/ports/raspberrypi/boards/adafruit_qt2040_trinkey/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Adafruit QT2040 Trinkey"
#define MICROPY_HW_MCU_NAME "rp2040"

#define CIRCUITPY_DRIVE_LABEL "P"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO27)

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO17)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO16)

#define DEFAULT_UART_BUS_RX (&pin_GPIO17)
#define DEFAULT_UART_BUS_TX (&pin_GPIO16)
